app/controllers/listings_controller.rb

  def create
    @listing=Listing.new(listing_params)

    if @listing.save
---
INSERT INTO "listings" ("created_at", "description", "image_url", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-11-18 14:58:12.061145"], ["description", "dsad"], ["image_url", "asd"], ["name", "asd"], ["updated_at", "2014-11-18 14:58:12.061145"], ["user_id", 1]]

  def show
    @listing=Listing.find(params[:id])
    @user= User.find(@listing.user_id)
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1